In [3]:
import numpy as np
import pandas as pd

In [15]:
dic = {
    'data':['01/01/2025','01/01/2025','01/02/2025','01/02/2025'],
    'tipo':['venda','compra','venda','compra'],
    'valor':[1,2,3,4]
}

In [16]:
dic

{'data': ['01/01/2025', '01/01/2025', '01/02/2025', '01/02/2025'],
 'tipo': ['venda', 'compra', 'venda', 'compra'],
 'valor': [1, 2, 3, 4]}

In [17]:
df = pd.DataFrame(dic)
df

         data    tipo  valor
0  01/01/2025   venda      1
1  01/01/2025  compra      2
2  01/02/2025   venda      3
3  01/02/2025  compra      4

In [24]:
df2 = pd.pivot_table(df,
                     values='valor',
                     index='data',
                     columns='tipo'
                    )
#df2.columns = ['data','compra','venda']
df2

tipo        compra  venda
data
01/01/2025     2.0    1.0
01/02/2025     4.0    3.0

In [26]:
df2.columns

Index(['compra', 'venda'], dtype='object', name='tipo')

In [28]:
type(df2)

pandas.core.frame.DataFrame

In [29]:
"""
df3 = pd.melt(df2,
              id_vars=['data'],
              value_vars=['compra','venda'],
              value_name='tipo'
             )

df3
"""

"\ndf3 = pd.melt(df2,\n              id_vars=['data'],\n              value_vars=['compra','venda'],\n              value_name='tipo'\n             )\n\ndf3\n"

In [30]:
df3 = df.copy()
df3

         data    tipo  valor
0  01/01/2025   venda      1
1  01/01/2025  compra      2
2  01/02/2025   venda      3
3  01/02/2025  compra      4

In [57]:
df3.iloc[0,2] = np.nan
df3

         data    tipo  valor
0  01/01/2025   venda    NaN
1  01/01/2025  compra    2.0
2  01/02/2025   venda   30.0
3  01/02/2025  compra    4.0

In [33]:
df3.dropna()

         data    tipo  valor
1  01/01/2025  compra    2.0
2  01/02/2025   venda    3.0
3  01/02/2025  compra    4.0

In [35]:
df3.fillna(df3['valor'].mean(), inplace=True)
df3

         data    tipo  valor
0  01/01/2025   venda    3.0
1  01/01/2025  compra    2.0
2  01/02/2025   venda    3.0
3  01/02/2025  compra    4.0

In [39]:
df3.isna().value_counts()

data   tipo   valor
False  False  False    3
              True     1
Name: count, dtype: int64

In [41]:
df3[df3['valor'].isna()]

         data   tipo  valor
0  01/01/2025  venda    NaN

In [58]:
df3.loc[:,df3.isnull().any()]

   valor
0    NaN
1    2.0
2   30.0
3    4.0

In [60]:
df3.loc[:, df3.notnull().all()]

         data    tipo
0  01/01/2025   venda
1  01/01/2025  compra
2  01/02/2025   venda
3  01/02/2025  compra

In [45]:
df3.fillna(df3['valor'].mean(), inplace=True)
df3

         data    tipo  valor
0  01/01/2025   venda    3.0
1  01/01/2025  compra    2.0
2  01/02/2025   venda    3.0
3  01/02/2025  compra    4.0

In [48]:
df3.replace(3,30, inplace=True)

In [61]:
df3

         data    tipo  valor
0  01/01/2025   venda    NaN
1  01/01/2025  compra    2.0
2  01/02/2025   venda   30.0
3  01/02/2025  compra    4.0

In [62]:
df3.fillna(30, inplace=True)
df3

         data    tipo  valor
0  01/01/2025   venda   30.0
1  01/01/2025  compra    2.0
2  01/02/2025   venda   30.0
3  01/02/2025  compra    4.0

In [64]:
df3[df3.valor.isin([30])]

         data   tipo  valor
0  01/01/2025  venda   30.0
2  01/02/2025  venda   30.0

In [67]:
df3.filter(items = [30])

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [68]:
df3

         data    tipo  valor
0  01/01/2025   venda   30.0
1  01/01/2025  compra    2.0
2  01/02/2025   venda   30.0
3  01/02/2025  compra    4.0

In [71]:
df4 = df3.set_index('data')

In [72]:
df4

              tipo  valor
data
01/01/2025   venda   30.0
01/01/2025  compra    2.0
01/02/2025   venda   30.0
01/02/2025  compra    4.0

In [73]:
df4.reset_index()

         data    tipo  valor
0  01/01/2025   venda   30.0
1  01/01/2025  compra    2.0
2  01/02/2025   venda   30.0
3  01/02/2025  compra    4.0

In [75]:
df4['valor'].unique()

array([30.,  2.,  4.])

In [76]:
df4.duplicated('valor')

data
01/01/2025    False
01/01/2025    False
01/02/2025     True
01/02/2025    False
dtype: bool

In [77]:
df4.drop_duplicates()

              tipo  valor
data
01/01/2025   venda   30.0
01/01/2025  compra    2.0
01/02/2025  compra    4.0

In [78]:
df4.groupby('tipo').sum()

        valor
tipo
compra    6.0
venda    60.0

In [80]:
help(pd.concat)

Help on function concat in module pandas.core.reshape.concat:

concat(
    objs: 'Iterable[Series | DataFrame] | Mapping[HashableT, Series | DataFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys: 'Iterable[Hashable] | None' = None,
    levels=None,
    names: 'list[HashableT] | None' = None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool | None' = None
) -> 'DataFrame | Series'
    Concatenate pandas objects along a particular axis.

    Allows optional set logic along the other axes.

    Can also add a layer of hierarchical indexing on the concatenation axis,
    which may be useful if the labels are the same (or overlapping) on
    the passed axis number.

    Parameters
    ----------
    objs : a sequence or mapping of Series or DataFrame objects
        If a mapping is passed, the sorted keys will be used as the `keys`
        argument, unless it is passed, in which case the values will be
        selected (see below). Any None objects will be dropped silently unless
        they are all None in which case a ValueError will be raised.
    axis : {0/'index', 1/'columns'}, default 0
        The axis to concatenate along.
    join : {'inner', 'outer'}, default 'outer'
        How to handle indexes on other axis (or axes).
    ignore_index : bool, default False
        If True, do not use the index values along the concatenation axis. The
        resulting axis will be labeled 0, ..., n - 1. This is useful if you are
        concatenating objects where the concatenation axis does not have
        meaningful indexing information. Note the index values on the other
        axes are still respected in the join.
    keys : sequence, default None
        If multiple levels passed, should contain tuples. Construct
        hierarchical index using the passed keys as the outermost level.
    levels : list of sequences, default None
        Specific levels (unique values) to use for constructing a
        MultiIndex. Otherwise they will be inferred from the keys.
    names : list, default None
        Names for the levels in the resulting hierarchical index.
    verify_integrity : bool, default False
        Check whether the new concatenated axis contains duplicates. This can
        be very expensive relative to the actual data concatenation.
    sort : bool, default False
        Sort non-concatenation axis if it is not already aligned. One exception to
        this is when the non-concatentation axis is a DatetimeIndex and join='outer'
        and the axis is not already aligned. In that case, the non-concatenation
        axis is always sorted lexicographically.
    copy : bool, default True
        If False, do not copy data unnecessarily.

    Returns
    -------
    object, type of objs
        When concatenating all ``Series`` along the index (axis=0), a
        ``Series`` is returned. When ``objs`` contains at least one
        ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
        the columns (axis=1), a ``DataFrame`` is returned.

    See Also
    --------
    DataFrame.join : Join DataFrames using indexes.
    DataFrame.merge : Merge DataFrames by indexes or columns.

    Notes
    -----
    The keys, levels, and names arguments are all optional.

    A walkthrough of how this method fits in with other tools for combining
    pandas objects can be found `here
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

    It is not recommended to build DataFrames by adding single rows in a
    for loop. Build a list of rows and make a DataFrame in a single concat.

    Examples
    --------
    Combine two ``Series``.

    >>> s1 = pd.Series(['a', 'b'])
    >>> s2 = pd.Series(['c', 'd'])
    >>> pd.concat([s1, s2])
    0    a
    1    b
    0    c
    1    d
    dtype: object

    Clear the existing index and reset it in the result
    by setting the ``ignore_index`` option to ``True``.

    >>> pd.concat([s1, s2], ignore_index=True)
    0    a
    1    b
    2    c
    3    d
    dtype: object

    Add a hierarchical index at the outermost level of
    the data with the ``keys`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'])
    s1  0    a
        1    b
    s2  0    c
        1    d
    dtype: object

    Label the index keys you create with the ``names`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'],
    ...           names=['Series name', 'Row ID'])
    Series name  Row ID
    s1           0         a
                 1         b
    s2           0         c
                 1         d
    dtype: object

    Combine two ``DataFrame`` objects with identical columns.

    >>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
    ...                    columns=['letter', 'number'])
    >>> df1
      letter  number
    0      a       1
    1      b       2
    >>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
    ...                    columns=['letter', 'number'])
    >>> df2
      letter  number
    0      c       3
    1      d       4
    >>> pd.concat([df1, df2])
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects with overlapping columns
    and return everything. Columns outside the intersection will
    be filled with ``NaN`` values.

    >>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
    ...                    columns=['letter', 'number', 'animal'])
    >>> df3
      letter  number animal
    0      c       3    cat
    1      d       4    dog
    >>> pd.concat([df1, df3], sort=False)
      letter  number animal
    0      a       1    NaN
    1      b       2    NaN
    0      c       3    cat
    1      d       4    dog

    Combine ``DataFrame`` objects with overlapping columns
    and return only those that are shared by passing ``inner`` to
    the ``join`` keyword argument.

    >>> pd.concat([df1, df3], join="inner")
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects horizontally along the x axis by
    passing in ``axis=1``.

    >>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
    ...                    columns=['animal', 'name'])
    >>> pd.concat([df1, df4], axis=1)
      letter  number  animal    name
    0      a       1    bird   polly
    1      b       2  monkey  george

    Prevent the result from including duplicate index values with the
    ``verify_integrity`` option.

    >>> df5 = pd.DataFrame([1], index=['a'])
    >>> df5
       0
    a  1
    >>> df6 = pd.DataFrame([2], index=['a'])
    >>> df6
       0
    a  2
    >>> pd.concat([df5, df6], verify_integrity=True)
    Traceback (most recent call last):
        ...
    ValueError: Indexes have overlapping values: ['a']

    Append a single row to the end of a ``DataFrame`` object.

    >>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
    >>> df7
        a   b
    0   1   2
    >>> new_row = pd.Series({'a': 3, 'b': 4})
    >>> new_row
    a    3
    b    4
    dtype: int64
    >>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
        a   b
    0   1   2
    1   3   4